# YOLOv11m with P2 Detection Head for Tiny Object Detection
# ============================================================
# 
# This configuration adds a P2 (stride 4) detection head to YOLOv11m
# for improved tiny object detection.
#
# Standard YOLOv11: P3 (stride 8), P4 (stride 16), P5 (stride 32)
# This version:     P2 (stride 4), P3 (stride 8), P4 (stride 16), P5 (stride 32)
#
# P2 provides 4x higher resolution feature maps, crucial for objects < 16x16 pixels

# Parameters
nc: 8  # number of classes (AI-TOD: 8 classes)
scales:
  # [depth, width, max_channels]
  m: [0.50, 1.00, 512]  # YOLOv11m (matches official scale)

# YOLOv11 backbone with P2 extraction
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]     # 0-P1/2  (stride 2)
  - [-1, 1, Conv, [128, 3, 2]]    # 1-P2/4  (stride 4)
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2 - P2 features (stride 4) ← extract here
  - [-1, 1, Conv, [256, 3, 2]]    # 3-P3/8  (stride 8)
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4 - P3 features
  - [-1, 1, Conv, [512, 3, 2]]    # 5-P4/16 (stride 16)
  - [-1, 2, C3k2, [512, True]]    # 6 - P4 features
  - [-1, 1, Conv, [1024, 3, 2]]   # 7-P5/32 (stride 32)
  - [-1, 2, C3k2, [1024, True]]   # 8 - P5 features
  - [-1, 1, SPPF, [1024, 5]]      # 9
  - [-1, 2, C2PSA, [1024]]        # 10

# YOLOv11 head with P2 support
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11 - upsample P5
  - [[-1, 6], 1, Concat, [1]]                    # 12 - concat with P4
  - [-1, 2, C3k2, [512, False]]                  # 13 - P4 features

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14 - upsample
  - [[-1, 4], 1, Concat, [1]]                    # 15 - concat with P3
  - [-1, 2, C3k2, [256, False]]                  # 16 - P3 features

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 17 - upsample to P2 scale
  - [[-1, 2], 1, Concat, [1]]                    # 18 - concat with backbone P2 (layer 2)
  - [-1, 2, C3k2, [128, False]]                  # 19 - P2 features (stride 4)

  # Bottom-up path
  - [-1, 1, Conv, [128, 3, 2]]                   # 20 - downsample P2
  - [[-1, 16], 1, Concat, [1]]                   # 21 - concat with P3
  - [-1, 2, C3k2, [256, False]]                  # 22 - P3 output

  - [-1, 1, Conv, [256, 3, 2]]                   # 23 - downsample P3
  - [[-1, 13], 1, Concat, [1]]                   # 24 - concat with P4
  - [-1, 2, C3k2, [512, False]]                  # 25 - P4 output

  - [-1, 1, Conv, [512, 3, 2]]                   # 26 - downsample P4
  - [[-1, 10], 1, Concat, [1]]                   # 27 - concat with P5
  - [-1, 2, C3k2, [1024, True]]                  # 28 - P5 output

  # Detection heads: P2, P3, P4, P5
  - [[19, 22, 25, 28], 1, Detect, [nc]]          # 29 - Detect(P2, P3, P4, P5)
