# YOLOv11m + TAAM + NWD for Tiny Object Detection
# ============================================================
#
# Architecture: Standard YOLOv11m backbone/neck + TAAM attention
# Novel components:
#   1. TAAM (Tiny-Aware Attention Module) - before detection heads
#   2. NWD (Normalized Wasserstein Distance) - applied in training script
#
# Key design: Keeps IDENTICAL layer structure as standard YOLOv11m
# through layer 22, so ALL pretrained weights transfer directly.
# TAAM layers (23-25) are new but initialize as identity (gamma=0),
# causing zero disruption at training start.
#
# Standard: Detect on [P3, P4, P5] from layers [16, 19, 22]
# This:     Detect on [TAAM(P3), TAAM(P4), TAAM(P5)] from layers [23, 24, 25]

# Parameters
nc: 8  # AI-TOD: 8 classes

scales:
  m: [0.50, 1.00, 512]  # YOLOv11m scale (identical to official)

# Backbone: IDENTICAL to standard YOLOv11m
backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4 - P3 features
  - [-1, 1, Conv, [512, 3, 2]]         # 5-P4/16
  - [-1, 2, C3k2, [512, True]]         # 6 - P4 features
  - [-1, 1, Conv, [1024, 3, 2]]        # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]        # 8 - P5 features
  - [-1, 1, SPPF, [1024, 5]]           # 9
  - [-1, 2, C2PSA, [1024]]             # 10

# Head: IDENTICAL to standard YOLOv11m through layer 22
head:
  # Top-down FPN
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11
  - [[-1, 6], 1, Concat, [1]]                    # 12
  - [-1, 2, C3k2, [512, False]]                  # 13 - P4 features

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                    # 15
  - [-1, 2, C3k2, [256, False]]                  # 16 - P3 features

  # Bottom-up PAN
  - [-1, 1, Conv, [256, 3, 2]]                   # 17
  - [[-1, 13], 1, Concat, [1]]                   # 18
  - [-1, 2, C3k2, [512, False]]                  # 19 - P4 output

  - [-1, 1, Conv, [512, 3, 2]]                   # 20
  - [[-1, 10], 1, Concat, [1]]                   # 21
  - [-1, 2, C3k2, [1024, True]]                  # 22 - P5 output

  # ============== TAAM: Tiny-Aware Attention (NOVEL) ==============
  # Applied to each detection level before the heads.
  # Initializes as identity (gamma=0) → no disruption to pretrained features.
  # Learns scale-adaptive attention during training.
  - [16, 1, TAAM, [256]]                          # 23 - TAAM on P3 (256 ch)
  - [19, 1, TAAM, [512]]                          # 24 - TAAM on P4 (512 ch)
  - [22, 1, TAAM, [512]]                          # 25 - TAAM on P5 (512 ch)

  # ============== Detection Heads ==============
  - [[23, 24, 25], 1, Detect, [nc]]               # 26 - Detect(P3, P4, P5)